package operator;

public class Ex04 {
	//연산자 : 값을 계산하여 다른 값을 만들어내거나 변화시키는 기호 미 단어의 집합
	public static void main(String[] args) {
		
		// 산술 연산 : +, -, *, /, %
		// 대입 연산 : =
		// 복합 대입 연산 : +=, -+, *=, /=, %=
		// 비교 연산 : >, <, >=, <=, ==, !=
		// 논리 연산 : &&, ||, !
		// 증감 연산 : +=, --
		// 단항 부호 연산 : -
		// 삼항 연산 : A? B : C
		// 기타 최우선 연산 : [] . {소유격 조사 [의] 의 의미, [배열]}
		//기타 연산 : , () instanceof new
		
		// 1항 (단항) 연산 : 1개의 항에 대하여 연산한다.
		// 2항 연산 : 2개의 항에 대하여 연산한다.
		// 3항 연산 : 3개의 항에 대하여 연산한다.
		
		
	}

}
